Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/court_offices/index.html.txt.tmx
Source language: en
Languages: ga

source: Functions of District Court Offices throughout Ireland are described
ga: Tá eolas anseo faon obair a dhéanann oifig na Cúirte Dúiche

source: Functions of Circuit Court Offices throughout Ireland are described
ga: Tá eolas anseo ar obair Oifige na Cúirte Chuardaí

source: Office of the High Court - the Central Office
ga: Oifig na hArd Chúirte - an Oifig Lárnach

source: An overview of the functions of the the Office of the High Court - the Central Office - in Ireland is provided
ga: Tá eolas ar fáil anseo ar Oifig na hArd Chúirte - an oifig Lárnach

source: Office of the Supreme Court
ga: Oifig an Chúirt Uachtarach

source: The functions of the Office of the Supreme Court in Ireland are described
ga: Cur síos ar fheidhmeanna an Chúirt Uachtarach

source: Office of the Court of Appeal – Civil
ga: Oifig na Cúirte Achomhairc – Sibhialta

source: The functions of the Office of the Court of Appeal for civil matters are described
ga: Cur síos ar fheidhmeanna Oifig na Cúirte Achomhairc maidir le nithe sibhialta

source: Office of the Court of Appeal – Criminal and Military
ga: Oifig na Cúirte Achomhairc – Choiriúil agus Míleata

source: The functions of the Office of the Court of Appeal for criminal and military matters are described
ga: Cur síos ar fheidhmeanna Oifig na Cúirte Achomhairc maidir le nithe coiriúla agus míleata

source: Office of Wards of Court
ga: Oifig na gCoimircithe Cúirte

source: The functions of the the Office of Wards of Court are described
ga: Feidhmeanna Oifig na gCoimircithe Cúirte

source: Office of the General Solicitor for Minors and Wards of Court
ga: Oifig an Ard-Aturnae do Mhionaoisigh agus do Choimircithe Cúirte

source: The functions of the Office of the General Solicitor for Minors and Wards of Court
ga: Cur síos ar fheidhmeanna Oifige an Aturnae Ginearálta do Mhionaoisigh agus Coimircigh Cúirte

source: The Probate Office deals with 'non contentious' probate matters and has other important functions including issuing grants of probate and administration
ga: Cur síos ar fheidhmeanna na hOifige Probháide

source: Office of the Taxing Master
ga: Oifig an Mháistir Fómhais

source: The functions of the Office of the Taxing Master in Ireland are described
ga: Cur síos ar fheidhmeanna oifig an Mháistir Fómhais

source: Office of the Accountant of the Courts of Justice
ga: Oifig Chuntasóra na gCúirteanna Cirte

source: The functions of the Office of the Accountant of the Courts of Justice in Ireland are described
ga: Cur síos ar fheidhmeanna Oifig Chuntasóra na gCúirteanna Cirte

source: The Examiner's Office supervises the liquidation of companies in Ireland and also has 8 important functions
ga: Tá eolas anseo faoín obair a dhéanann Oifig an Scrúdaitheora

source: Most Read in "Justice"
ga: Ábhar is mó éilimh i "Dlí"

source: Alcohol and the law
ga: Alcól agus an dlí
